Revit 2025 API
ControlledApplication.AllUsersAddinsLocation Property
 The folder location for .addin files for all users.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string AllUsersAddinsLocation { get; }
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
member AllUsersAddinsLocation : string with get
Property Value
String
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace